/******************************************************************************************
 * OBC2_app.c
 * ver1.00
 * Tetsuya Kaku
 *=========================================================================================
 * OBC2プロトコルのソースファイル
 *
 *=========================================================================================
 * ・ver1.00 || 2016/03/06 || Tetsuya Kaku
 *   初版作成
 *=========================================================================================
 * PIC16F877A
 * MPLAB X IDE
 * XC8
 *=========================================================================================
 * Created by fabsat Project(Tokai university Satellite Project[TSP])
 *****************************************************************************************/
#include <xc.h>
#include "pic_clock.h"
#include "system_protocol.h"
#include "spi_master.h"
#include "OBC2_app.h"

/*=====================================================
 * @brief
 *     MCLRによるOBC1リセットの初期化
 * @param
 *     void:
 * @return
 *     void:
 * @note
 *     none
 *===================================================*/
void OBC1_RESET_init(void)
{
    uint8_t *nin;
    nin = PORTE_REG_ADR;     // PORTEのレジスタアドレスをポインタ変数に格納

    /* MCLRリセットに使用する各I/Oピンを出力に設定 */
    OBC1_MCLR = 0;
    
    /* 信号をHighにしてリセットOff */
    *nin = PORTE_POEWR_ON;
}

/*=====================================================
 * @brief
 *     MCLRによってOBC1をリセットを実行
 * @param
 *     void:
 * @return
 *     void:
 * @note
 *     none
 *===================================================*/
void OBC1_reset(void)
{
    uint8_t *nin;
    nin = PORTE_REG_ADR;
    
    /* リセット実行 */
    *nin = 0;      // OBC1をリセット(RE0ピンをLOWに)
    __delay_ms(10);
    *nin = PORTE_POEWR_ON;              // 全てHIGHにして再起動
}



